# Pandas

In [42]:
import pandas as pd

In [43]:
name=["rj", "raj", "raja"]
pd.Series(name)

0      rj
1     raj
2    raja
dtype: object

In [44]:
num=[1,2,3]
pd.Series(num)

0    1
1    2
2    3
dtype: int64

In [45]:
num=[1,2,None]
pd.Series(num)

0    1.0
1    2.0
2    NaN
dtype: float64

In [46]:
import numpy as np
np.nan == None

False

In [47]:
np.nan == np.nan

False

In [48]:
np.isnan(np.nan)

True

nan is semilar to none but it is a numaric value and treating differently for eficianct purpose

In [49]:
student = {"class": "science", "name": "Rj"}
s= pd.Series(student)
s

class    science
name          Rj
dtype: object

In [50]:
s.index

Index(['class', 'name'], dtype='object')

# Querying a Series

In [51]:
stu = {"ram":"math", "sam":"phy","moni":"che"}
s= pd.Series(stu)
s

ram     math
sam      phy
moni     che
dtype: object

In [52]:
s.iloc[2]

'che'

In [53]:
s.loc["sam"]

'phy'

In [54]:
s["sam"]

'phy'

In [55]:
stu = {1:"math", 2:"phy",5:"che"}
s= pd.Series(stu)
s

1    math
2     phy
5     che
dtype: object

In [56]:
s.iloc[2]

'che'

In [57]:
num = pd.Series(np.random.randint(0,1000,10000))
num.head()

0    394
1    421
2    989
3    733
4    599
dtype: int32

In [58]:
%%timeit -n 100
total =0
for nu in num:
    total += nu
total//len(num)

2.14 ms ± 202 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [59]:
%%timeit -n 100

sum(num)//len(num)

1.45 ms ± 135 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [60]:
%%timeit -n 100

np.sum(num)//len(num)

134 µs ± 28.4 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [61]:
num.head()

0    394
1    421
2    989
3    733
4    599
dtype: int32

In [62]:
%%timeit -n 10
num = pd.Series(np.random.randint(0,1000,10000))
num += 2
num.head()

672 µs ± 322 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [63]:
stu = pd.Series({"ram":"math", "sam":"phy","moni":"che"})
kal = pd.Series(["ben","eng"], index=["raj","raj"])
kal

raj    ben
raj    eng
dtype: object

In [64]:
n = stu.append(kal)
n

ram     math
sam      phy
moni     che
raj      ben
raj      eng
dtype: object

In [65]:
n.loc["raj"]

raj    ben
raj    eng
dtype: object

# Data Frame

In [66]:
record1 = pd.Series({'Name': 'Alice',
                        'Class': 'Physics',
                        'Score': 85})
record2 = pd.Series({'Name': 'Jack',
                        'Class': 'Chemistry',
                        'Score': 82})
record3 = pd.Series({'Name': 'Helen',
                        'Class': 'Biology',
                        'Score': 90})

df = pd.DataFrame([record1, record2, record3],
                  index=['school1', 'school2', 'school1'])
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [67]:
df = pd.DataFrame([record1, record2, record3])
df.head()

    Name      Class  Score
0  Alice    Physics     85
1   Jack  Chemistry     82
2  Helen    Biology     90

In [68]:
students = [{'Name': 'Alice',
              'Class': 'Physics',
              'Score': 85},
            {'Name': 'Jack',
             'Class': 'Chemistry',
             'Score': 82},
            {'Name': 'Helen',
             'Class': 'Biology',
             'Score': 90}]
df = pd.DataFrame(students, index=['school1', 'school2', 'school1'])
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [69]:
print(df.loc["school2"])
type(df.loc["school2"])

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

pandas.core.series.Series

In [70]:
print(df.loc["school1"])
type(df.loc["school1"])

          Name    Class  Score
school1  Alice  Physics     85
school1  Helen  Biology     90

pandas.core.frame.DataFrame

In [71]:
df.loc['school1', 'Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [72]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [73]:
df["Score"]
# df["school2"] ERROR

school1    85
school2    82
school1    90
Name: Score, dtype: int64

In [74]:
df.loc["school2"]
# df.loc["Score"] ERROR
# df.loc[:,"Score"] No ERROR

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

In [75]:
print(type(df["Score"]))
print(type(df.loc["school2"]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [76]:
df.T

       school1    school2  school1
Name     Alice       Jack    Helen
Class  Physics  Chemistry  Biology
Score       85         82       90

In [77]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [78]:
print(df.loc[:,"Name"])
df.loc["school2",:]

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

Drop Col

In [79]:
# df.drop("Name") ERROR
df.drop("school2")

          Name    Class  Score
school1  Alice  Physics     85
school1  Helen  Biology     90

In [80]:
df # so df.drop() actualy did not drop row it return update df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [81]:
copy_df = df.copy()
copy_df.drop("Name", inplace=True, axis=1)
copy_df

             Class  Score
school1    Physics     85
school2  Chemistry     82
school1    Biology     90

In [82]:
# copy_df.drop("Name", inplace=True, axis=1)

# copy_df

In [83]:
# copy_df.drop("Class") #Error
copy_df.drop("Class",axis=1) #axis 1 = col axis 0 = row

         Score
school1     85
school2     82
school1     90

In [84]:
copy_df   #As we don't used inplace=True

             Class  Score
school1    Physics     85
school2  Chemistry     82
school1    Biology     90

In [85]:
df['From'] = 'Kolkata'

In [86]:
df

          Name      Class  Score     From
school1  Alice    Physics     85  Kolkata
school2   Jack  Chemistry     82  Kolkata
school1  Helen    Biology     90  Kolkata

# Data Frame Indixing and Loding

In [87]:
df=pd.read_csv("admition.csv")
df.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [88]:
df=pd.read_csv("admition.csv", index_col=0)# serial No will be index
df

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65
...,...,...,...,...,...,...,...,...
396,324,110,3,3.5,3.5,9.04,1,0.82
397,325,107,3,3.0,3.5,9.11,1,0.84
398,330,116,4,5.0,4.5,9.45,1,0.91
399,312,103,3,3.5,4.0,8.78,0,0.67
400,333,117,4,5.0,4.0,9.66,1,0.95

In [89]:
df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'SOP', 'LOR ', 'CGPA',
       'Research', 'Chance of Admit '],
      dtype='object')

In [90]:
new_df=df.rename(columns={'LOR ': 'Letter of Recommendation'})
new_df.head()

,GRE Score,TOEFL Score,University Rating,SOP,Letter of Recommendation,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [91]:
df=df.rename(mapper=str.strip, axis='columns')
new_df.columns
#Remove space or tab from columns name

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'SOP',
       'Letter of Recommendation', 'CGPA', 'Research', 'Chance of Admit '],
      dtype='object')

In [92]:
cols = [col.lower().strip() for col in df.columns]
df.columns=cols
df.head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65